{
  "_intro" :  {
            "title": "Geospatial Semantics and the Semantic Web",
            "abstract": "Discusses geospatial ontology development, related standards, geospatial ontology alignment and integration, and algorithmic techniques for geospatial semanticsCovers the development and maintenance of standard ontologies. Case studies and examples will be provided throughout this book as well as possibilities for future research",
            "keywords": ""},

  "chapter_1" : {
            "title": "SPARQL-ST: Extending SPARQL to Support Spatiotemporal Queries",
            "abstract": "Spatial and temporal data is plentiful on the Web, and Semantic Web technologies have the potential to make this data more accessible and more useful. Semantic Web researchers have consequently made progress towards better handling of spatial and temporal data.SPARQL, the W3C-recommended query language for RDF, does not adequately support complex spatial and temporal queries. In this work, we present the SPARQL-ST query language. SPARQL-ST is an extension of SPARQL for complex spatiotemporal queries. We present a formal syntax and semantics for SPARQL-ST. In addition, we describe a prototype implementation of SPARQL-ST and demonstrate the scalability of this implementation with a performance study using large real-world and synthetic RDF datasets.",
            "keywords": ""},


   "chapter_2" : {
            "title": "Topographic Mapping Data Semantics Through Data Conversion and Enhancement",
            "abstract": "This paper presents research on the semantics of topographic data for triples and ontologies to blend the capabilities of the Semantic Web and The National Map of the U.S. Geological Survey. Automated conversion of relational topographic data of several geographic sample areas to the triple data model standard resulted in relatively poor semantic associations. Further research employed vocabularies of feature type and spatial relation terms. A user interface was designed to model the capture of non-standard terms relevant to public users and to map those terms to existing data models of The National Map through the use of ontology. Server access for the study area triple stores was made publicly available, illustrating how the development of linked data may transform institutional policies to open government data resources to the public. This paper presents these data conversion and research techniques that were tested as open linked data concepts leveraged through a user-centered interface and open USGS server access to the public.",
            "keywords": ""},

  "chapter_3" : {
    "title": "Location-Based Access Control Using Semantic Web Technologies",
    "abstract": "Location-based applications are an important case within context-aware applications. They pose interesting challenges when access control is considered for they must satisfy requirements arising from the mobility of both users and resources. Further challenges arise in collaborative environments where resources are shared by users of different organizations. In this paper we propose an access control framework based on the Role Based Access Control (RBAC) model where users and resources are abstracted as sets of attributes that include their geospatial position. In our framework, collaboration is achieved through the interoperation of the access control systems of the collaborating organizations. We use Semantic Web languages, namely OWL and SPARQL. We argue that their expressive power can model a wide range of RBAC policies. In particular, reasoning as provided by OWL supports both a standard enforcement mechanism and interoperation. We have implemented our framework and studied time performance as a function of the number of users and of the roles they can assume. Our implementation also features an interface that visually depicts users and resources on a map. As users move around, the set of actions that they can execute on the resources is shown.",
    "keywords": ""},

"chapter_4" : {
    "title": "Representing and Utilizing Changing Historical Places as an Ontology Time Series",
    "abstract": "Place names and their geographical coverage change in time. This causes problems when retrieving information content related to different times. Geo-content is usually indexed using place names of the time of indexing (e.g. a photo of the 1968 upraise of Czechoslovakia indexed then) or of the time that the content has been used or created (e.g. a spear used in the Punic Wars in 146 b.c. in Carthago but indexed at a later time using place names of that time).  Finally, end-users may query content in terms of contemporary place names (e.g. Check Republic or Slovakia) or overlapping historic names of different times (e.g. Roman Empire). This chapter presents an ontology-based approach to this problem. The idea is to represent and maintain a time series of spatial ontologies in terms of easily manageable local spatio-temporal changes from which the actual time series ontology can be generated automatically with semantic enrichment. This ontology can then be used for indexing and for mapping spatio-temporal regions and their names onto each other. As a proof-of-concept, the system has been applied to modeling the history municipalities of Finland in 1865-2010. We present the model, a tool for maintaining the change history in a user-friendly way, transformation of the place change history into an ontology time series with semantic enrichment, and publication of the ontology as a ready to use ontology services on the web with AJAX, Web Service, and REST interfaces. The system has been applied in the semantic cultural heritage portal CultureSampo for semantic search and recommendation, as well as an external service for indexing cultural heritage content, and for query expansion search in a legacy cultural heritage database system."
    ,
    "keywords": ""
},

"chapter_5" : {
    "title": "Semantic Referencing of Geosensor Data and Volunteered Geographic Information",
    "abstract": "Georeferencing and semantic annotations improve the findability of geoinformation because they exploit relationships to existing data and hence facilitate queries. Unlike georeferencing, which grounds location information in reference points on the earth's surface, semantic annotations often lack relations to entities of shared experience. We suggest an approach to semantically reference geoinformation based on underlying observations, relating data to observable entities and actions. After discussing an ontology for an observer's domain of experience, we demonstrate our approach through two use cases. First, we show how to distinguish geosensors based on observed properties and abstracting from technical implementations. Second, we show how to complement annotations of volunteered geographic information with observed affordances.",
    "keywords": ""},

"chapter_6" : {
    "title": "Spatial Cyberinfrastructure: Building New Pathways for Geospatial Semantics on Existing Infrastructures",
    "abstract": "Spatial data infrastructures (SDI), with technological and conceptual roots stretching back multiple decades, are moving into a new era through the development of spatial cyberinfrastructures (spatial CI) that account for geospatial semantics. While the technology and concepts share many similarities, spatial cyberinfrastructures distinctly focus on the provision of information to support scientific knowledge sharing. These cyberinfrastructures are increasingly connected into an ecology of scientific knowledge sharing based on the formalization of geospatial semantics and support for shared knowledge and collective intelligence. We trace the development of cyberinfrastructures from spatial data infrastructures as the potential framework for geospatial semantical interoperability. The chapter also points to substantial semantic research challenges and the potential of spatial cyberinfrastructures."
    ,
    "keywords": ""},

"chapter_7" : {
    "title": "Ontology-Based Geospatial Approaches for Semantic Awareness in Earth Observation Systems",
    "abstract": "Current work towards making earth observation systems semantically aware attempts to improve user experience by allowing more flexibility in the way that users interact with earth observation systems. Such improvements may occur directly by making data discovery more semantically-flexible, and indirectly in providing intelligent functionality that removes some of the load from users in interpretation of data and processes. Semantic awareness in earth observation systems may be addressed from four different angles: semantics and information modelling; semantic data management; semantic data discovery and semantic data processing. Each of these areas is the subject of ongoing and developing research in the broader geospatial community, has been applied in a number of different situations and systems, and presents particular challenges for earth observation systems. The Global Earth Observation System of Systems (GEOSS) is a large, global, heterogeneous earth observation system and provides a case study of the use of different methods for achieving semantic awareness in each of these four areas. Furthermore, an example architecture for an earth observation system that involves multiple aligned ontologies illustrates the challenges posed by real world, heterogeneous systems. In combination, the review of related work, applications and challenges in each of the four areas, together with the GEOSS case study and example architecture provide an indication of the state of the art in semantic research as it applies to earth observation system. Furthermore, this summary provides a hint towards the future for semantics in earth observation systems and the need for additional work in this area."
    ,
    "keywords": ""
}
}
